from langchain.embeddings import OllamaEmbeddings
from langchain.vectorstores import FAISS
from haystack.nodes import EmbeddingRetriever
from haystack.document_stores.faiss import FAISSDocumentStore


menu = [
    "김치찌개", "된장찌개", "순두부찌개", "갈비탕", "설렁탕", "육개장", "불고기", "비빔밥", "김밥", "떡볶이",
    "순대", "만두", "라면", "냉면", "칼국수", "수제비", "잡채", "불닭볶음면", "쭈꾸미볶음", "삼겹살",
    "제육볶음", "닭갈비", "오징어볶음", "낙지볶음", "보쌈", "족발", "해물파전", "김치전", "빈대떡", "감자전",
    "호박전", "파전", "양념치킨", "후라이드치킨", "간장치킨", "닭강정", "찜닭", "닭볶음탕", "닭도리탕", "순살치킨",
    "양념갈비", "돼지갈비", "소갈비", "갈비찜", "돼지불고기", "소불고기", "고추장불고기", "간장불고기", "육회",
    "곱창", "대창", "막창", "삼겹살구이", "목살구이", "항정살구이", "가브리살구이", "갈매기살구이", "소갈비살구이",
    "돼지갈비살구이", "돼지껍데기", "돼지양념갈비", "소양념갈비", "소갈비찜", "돼지갈비찜", "소불고기전골", "돼지불고기전골",
    "해물탕", "매운탕", "알탕", "아구찜", "해물찜", "갈치조림", "고등어조림", "임연수어조림", "참치조림", "꽁치조림",
    "장어구이", "연어구이", "고등어구이", "갈치구이", "조기구이", "삼치구이", "임연수어구이", "참치구이", "꽁치구이",
    "생선까스", "새우튀김", "오징어튀김", "고구마튀김", "김말이튀김", "야채튀김", "감자튀김", "치즈스틱", "돈가스",
    "치킨가스", "생선가스", "새우가스", "고구마가스", "버섯가스", "야채가스", "누룽지", "누룽지탕", "죽", "전복죽",
    "닭죽", "새우죽", "야채죽", "호박죽", "팥죽", "녹두죽", "소고기죽", "김치볶음밥", "새우볶음밥", "야채볶음밥",
    "낙지볶음밥", "햄볶음밥", "참치볶음밥", "스팸볶음밥", "오므라이스", "카레라이스", "하이라이스", "짬뽕", "짜장면",
    "탕수육", "팔보채", "깐풍기", "양장피", "고추잡채", "마파두부", "동파육", "라조기", "유산슬", "깐쇼새우",
    "깐쇼치킨", "양꼬치", "마라탕", "훠궈", "양고기", "북경오리", "샤부샤부", "스키야키", "돈부리", "카츠동",
    "텐동", "규동", "오야코동", "새우덮밥", "장어덮밥", "회를", "참치회", "연어회", "광어회", "우럭회",
    "방어회", "전복회", "문어회", "한치회", "오징어회", "멍게회", "개불회", "해삼회", "산낙지", "소바",
    "우동", "라멘", "스시", "니기리즈시", "마키즈시", "후토마키", "가라아게", "타코야키", "오코노미야키", "야키소바",
    "텐푸라", "카츠", "돈카츠", "치킨카츠", "새우카츠", "고로케", "야키토리", "다키코미고항", "오니기리", "모찌",
    "다이후쿠", "도라야키", "타이야키", "파스타", "스파게티", "피자", "리조또", "그라탱", "라자냐", "샌드위치",
    "햄버거", "핫도그", "클럽샌드위치", "베이글", "크로와상", "팬케이크", "와플", "프렌치토스트", "오믈렛", "에그베네딕트",
    "샐러드", "시저샐러드", "그릭샐러드", "콥샐러드", "니스와샐러드", "퀴노아샐러드", "참치샐러드", "치킨샐러드", "연어샐러드",
    "스테이크", "리브아이", "티본스테이크", "필레미뇽", "뉴욕스트립", "포터하우스", "럼프스테이크", "토마호크", "바베큐립",
    "바베큐치킨", "바베큐플래터", "칠리콘카르네", "타코", "브리또", "퀘사디아", "엔칠라다", "파히타", "나초", "타말레",
    "파에야", "감바스", "아히요", "타파스", "하몽", "츄러스"]


embeddings = OllamaEmbeddings(
  model="llama3:8b"
)

def recommend_menu(keyword, menu): 
  best_match_top_3 = []
  
  out = FAISS.from_texts(menu, embeddings)
  results_with_scores = out.similarity_search_with_score(keyword)

  best_match_top_3 = [result[0].page_content for result in results_with_scores[:3]]
  return best_match_top_3


keyword = input("keyword: ")

recommendations = recommend_menu(keyword, menu)

print("저메추: ", recommendations)
